# pandas

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
latters = ['a','b','c']
numbers = [1,2,3]
np_arr = np.array(numbers)
dict = {'a':1,'b':2,'c':3}

In [5]:
latters

['a', 'b', 'c']

In [6]:
numbers

[1, 2, 3]

In [7]:
np_arr

array([1, 2, 3])

In [8]:
dict

{'a': 1, 'b': 2, 'c': 3}

In [10]:
pd.Series(data = numbers)

0    1
1    2
2    3
dtype: int64

In [19]:
pd.Series(data = numbers, index = latters)

a    1
b    2
c    3
dtype: int64

In [20]:
new = pd.Series(latters,numbers)

In [21]:
new + new

1    aa
2    bb
3    cc
dtype: object

In [63]:
my_df = pd.DataFrame(np.random.randn(4,5),[1,2,3,4,],['red','orange','yallow','blue','green'])

In [54]:
my_df

        red    orange    yallow      blue     green
1  0.341189  0.439028  0.335585 -0.804825  1.696999
2  1.675501  0.136915  0.349051 -0.460787  1.206540
3  0.939810  1.458592  0.360792 -0.480049  0.410658
4  1.163294  1.827354 -0.526605 -1.770506 -0.675966

In [55]:
my_df['indigo'] = my_df['red']+my_df['orange']
my_df['voilat'] = my_df['indigo']+my_df['green']

In [56]:
my_df

        red    orange    yallow      blue     green    indigo    voilat
1  0.341189  0.439028  0.335585 -0.804825  1.696999  0.780217  2.477216
2  1.675501  0.136915  0.349051 -0.460787  1.206540  1.812416  3.018955
3  0.939810  1.458592  0.360792 -0.480049  0.410658  2.398402  2.809060
4  1.163294  1.827354 -0.526605 -1.770506 -0.675966  2.990648  2.314682

In [57]:
my_df.loc[1]

red       0.341189
orange    0.439028
yallow    0.335585
blue     -0.804825
green     1.696999
indigo    0.780217
voilat    2.477216
Name: 1, dtype: float64

In [58]:
my_df.iloc[1]

red       1.675501
orange    0.136915
yallow    0.349051
blue     -0.460787
green     1.206540
indigo    1.812416
voilat    3.018955
Name: 2, dtype: float64

In [60]:
my_df.drop[1]

TypeError: 'method' object is not subscriptable

In [2]:
import pandas as pd

df1 = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'id': [1, 2, 4],
    'marks': [85, 90, 95]
})

In [14]:
pd.merge(df1,df2,how = "outer")

   id     name  marks
0   1    Alice   85.0
1   2      Bob   90.0
2   3  Charlie    NaN
3   4      NaN   95.0

In [16]:
import pandas as pd

data = {
    'Department': ['Sales', 'Sales', 'HR', 'HR', 'IT', 'IT'],
    'Employee': ['A', 'B', 'C', 'D', 'E', 'F'],
    'Gender': ['M', 'F', 'F', 'M', 'M', 'F'],
    'Salary': [50000, 52000, 42000, 41000, 60000, 62000]
}

df = pd.DataFrame(data)
print(df)

  Department Employee Gender  Salary
0      Sales        A      M   50000
1      Sales        B      F   52000
2         HR        C      F   42000
3         HR        D      M   41000
4         IT        E      M   60000
5         IT        F      F   62000

In [24]:
pd.pivot_table(df,index="Department",values = "Salary", aggfunc='mean')

             Salary
Department
HR          41500.0
IT          61000.0
Sales       51000.0

In [14]:
# Import missing random module
import random

# Regenerate the data after importing random
products = ['Laptop', 'Smartphone', 'Tablet', 'Monitor', 'Keyboard', 'Mouse', 'Printer', 'Router']
regions = ['North', 'South', 'East', 'West']
salespersons = ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank']
payment_methods = ['Credit Card', 'Cash', 'Online Transfer', 'UPI']

data = []
start_date = datetime(2024, 1, 1)

for i in range(50):
    sale_date = start_date + timedelta(days=random.randint(0, 100))
    units_sold = random.randint(1, 20)
    unit_price = round(random.uniform(50, 1000), 2)
    total_sale = round(units_sold * unit_price, 2)
    data.append({
        'Date': sale_date.strftime('%Y-%m-%d'),
        'Product': random.choice(products),
        'Region': random.choice(regions),
        'Salesperson': random.choice(salespersons),
        'Units Sold': units_sold,
        'Unit Price': unit_price,
        'Total Sale': total_sale,
        'Payment Method': random.choice(payment_methods)
    })

# Convert to DataFrame
df = pd.DataFrame(data)

# Save to CSV

df.to_csv("sample_sales_data.csv", index=False)

In [16]:
df = pd.read_csv("sample_sales_data.csv")

In [48]:
df.head(10)

,Date,Product,Region,Salesperson,Units Sold,Unit Price,Total Sale,Payment Method
0,2024-03-13,Mouse,North,Eva,13,51.38,667.94,UPI
1,2024-02-08,Router,West,Bob,13,685.09,8906.17,Credit Card
2,2024-01-13,Laptop,South,Bob,3,448.74,1346.22,UPI
3,2024-01-18,Printer,North,David,10,406.70,4067.00,UPI
4,2024-02-20,Printer,South,David,11,828.51,9113.61,UPI
5,2024-03-01,Smartphone,South,Charlie,8,358.59,2868.72,Online Transfer
6,2024-03-13,Monitor,West,Charlie,6,931.90,5591.40,Online Transfer
7,2024-03-31,Mouse,North,David,3,343.64,1030.92,Credit Card
8,2024-01-11,Router,South,Eva,19,690.17,13113.23,Online Transfer
9,2024-01-26,Laptop,West,Frank,9,815.78,7342.02,Cash

In [20]:
df.shape

(50, 8)

In [42]:
# pd.pivot_table(df,index="Salesperson",columns=["Region","Product"])
pd.pivot_table(df, index='Salesperson', values='Total Sale', aggfunc='sum')

             Total Sale
Salesperson
Alice          35962.13
Bob            26954.97
Charlie        40435.51
David          90439.40
Eva            31473.23
Frank          48337.76

In [6]:
ser = pd.Series(np.random.random(20))

In [8]:
ser

0     0.088022
1     0.014063
2     0.075614
3     0.717626
4     0.781826
5     0.923992
6     0.056776
7     0.342430
8     0.651794
9     0.028461
10    0.546023
11    0.946750
12    0.202618
13    0.594315
14    0.069247
15    0.106812
16    0.345923
17    0.102900
18    0.977110
19    0.576357
dtype: float64

In [40]:
# '''20. How to compute difference of differences between consequtive numbers of a series?'''
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])
# def diff(n):
#  ans =[float(n[i+1]-n[i]) for i,val in enumerate(ser.iloc[:-1])]
#  return ans

ans = []
for i in range(len(ser)-1):
    # if i >= len(ser)-1:
    #     ans.append()
        
    ans.append(ser[i+1]-ser[i])
    

# a=diff(ser)
# print(a)
# b=diff(a)
# print(b)
ans

[2, 3, 4, 5, 6, 6, 8]

In [30]:
list(map(diff,int(ser)))

TypeError: cannot convert the series to <class 'int'>

In [86]:
np.random.seed(100)
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))

df = pd.DataFrame()
df["fruit"] = fruit
df["weights"]= weights
df.head()

df3 = df.groupby("fruit")["weights"].agg(['count',"sum"])
df2 = df.groupby("fruit")["weights"].mean()
df2
#> [1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
#> ['banana', 'carrot', 'apple', 'carrot', 'carrot', 'apple', 'banana', 'carrot', 'apple', 'carrot']

fruit
apple     3.0
banana    8.0
carrot    7.0
Name: weights, dtype: float64

In [88]:
df3

        count   sum
fruit
apple       4  12.0
banana      1   8.0
carrot      5  35.0

In [90]:
df3["Mean"] = df3["sum"]/df3["count"]

In [78]:
df3

        count   sum      Mean
fruit
apple       5  28.0  5.600000
banana      3  11.0  3.666667
carrot      2  16.0  8.000000

In [92]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

In [100]:
# lst = []
# for i in range(len(p)-1):
#     lst.append(np.sqrt((p[i]-p[i+1])**2 + (q[i]-q[i+1])**2))
# sum(lst)

12.727922061357859

In [108]:
np.sqrt(np.sum((p-q)**2))

18.16590212458495

30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?

In [121]:
np.arange("2000-01-01","2000-02-01",dtype='datetime64')

array(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
       '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
       '2000-01-09', '2000-01-10', '2000-01-11', '2000-01-12',
       '2000-01-13', '2000-01-14', '2000-01-15', '2000-01-16',
       '2000-01-17', '2000-01-18', '2000-01-19', '2000-01-20',
       '2000-01-21', '2000-01-22', '2000-01-23', '2000-01-24',
       '2000-01-25', '2000-01-26', '2000-01-27', '2000-01-28',
       '2000-01-29', '2000-01-30', '2000-01-31'], dtype='datetime64[D]')

In [ ]:
np.random